
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 4 to change, 39 to destroy.</code></pre>

* Update
  * module.wa_task_management_api_database_flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.wa_task_management_api_database_flexible.azurerm_resource_group.rg[0]
  * module.wa_task_management_api_database_flexible_replica.azurerm_postgresql_flexible_server.pgsql_server
  * module.wa_task_management_api_database_flexible_replica.azurerm_resource_group.rg[0]
* Delete
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-PASS-FLEXIBLE-REPLICA-2[0]
  * azurerm_key_vault_secret.POSTGRES-USER
  * azurerm_key_vault_secret.POSTGRES-USER-FLEXIBLE-REPLICA-2[0]
  * azurerm_key_vault_secret.POSTGRES_DATABASE
  * azurerm_key_vault_secret.POSTGRES_DATABASE-FLEXIBLE-REPLICA-2[0]
  * azurerm_key_vault_secret.POSTGRES_HOST
  * azurerm_key_vault_secret.POSTGRES_HOST-FLEXIBLE-REPLICA-2[0]
  * azurerm_key_vault_secret.POSTGRES_PORT
  * azurerm_key_vault_secret.POSTGRES_PORT-FLEXIBLE-REPLICA-2[0]
  * module.wa_task_management_api_database.azurerm_postgresql_active_directory_administrator.admin
  * module.wa_task_management_api_database.azurerm_resource_group.data-resourcegroup
  * module.wa_task_management_api_database.azurerm_template_deployment.postgres-paas
  * module.wa_task_management_api_database.null_resource.set-user-permissions[0]
  * module.wa_task_management_api_database.null_resource.subnet_mappings[0]
  * module.wa_task_management_api_database.null_resource.subnet_mappings[1]
  * module.wa_task_management_api_database.null_resource.subnet_mappings[2]
  * module.wa_task_management_api_database.null_resource.subnet_mappings[3]
  * module.wa_task_management_api_database.null_resource.subnet_mappings[4]
  * module.wa_task_management_api_database.null_resource.subnet_mappings[5]
  * module.wa_task_management_api_database.null_resource.subnet_mappings[6]
  * module.wa_task_management_api_database.null_resource.subnet_mappings[7]
  * module.wa_task_management_api_database.null_resource.subnet_mappings[8]
  * module.wa_task_management_api_database.null_resource.subnet_mappings[9]
  * module.wa_task_management_api_database.null_resource.subnet_mappings[10]
  * module.wa_task_management_api_database.null_resource.subnet_mappings[11]
  * module.wa_task_management_api_database.null_resource.subnet_mappings[12]
  * module.wa_task_management_api_database.null_resource.subnet_mappings[13]
  * module.wa_task_management_api_database.random_string.password
  * module.wa_task_management_api_database_flexible_replica_2[0].azurerm_postgresql_flexible_server.pgsql_server
  * module.wa_task_management_api_database_flexible_replica_2[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.wa_task_management_api_database_flexible_replica_2[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.wa_task_management_api_database_flexible_replica_2[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.wa_task_management_api_database_flexible_replica_2[0].azurerm_postgresql_flexible_server_database.pg_databases[&#34;cft_task_db&#34;]
  * module.wa_task_management_api_database_flexible_replica_2[0].azurerm_resource_group.rg[0]
  * module.wa_task_management_api_database_flexible_replica_2[0].null_resource.set-user-permissions-additionaldbs[&#34;cft_task_db&#34;]
  * module.wa_task_management_api_database_flexible_replica_2[0].random_password.password
* Replace
  * module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-PASS is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      - id                      = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-PASS/f521186aa64140b6a9aa1613eaa239b3" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat" -> null
      - name                    = "cft-task-POSTGRES-PASS" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat/secrets/cft-task-POSTGRES-PASS/versions/f521186aa64140b6a9aa1613eaa239b3" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat/secrets/cft-task-POSTGRES-PASS" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "f521186aa64140b6a9aa1613eaa239b3" -> null
      - versionless_id          = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-PASS" -> null
    }

  # azurerm_key_vault_secret.POSTGRES-PASS-FLEXIBLE-REPLICA-2[0] will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-PASS-FLEXIBLE-REPLICA-2 is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-PASS-FLEXIBLE-REPLICA-2" {
      - content_type            = "" -> null
      - id                      = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-PASS-FLEXIBLE-REPLICA-2/6cbfd285b1844d7d88cb89dc86f27ab1" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat" -> null
      - name                    = "cft-task-POSTGRES-PASS-FLEXIBLE-REPLICA-2" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat/secrets/cft-task-POSTGRES-PASS-FLEXIBLE-REPLICA-2/versions/6cbfd285b1844d7d88cb89dc86f27ab1" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat/secrets/cft-task-POSTGRES-PASS-FLEXIBLE-REPLICA-2" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "6cbfd285b1844d7d88cb89dc86f27ab1" -> null
      - versionless_id          = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-PASS-FLEXIBLE-REPLICA-2" -> null
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-USER is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-USER" {
      - id                      = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-USER/52624bae09424e05b8ba7129fdc3d54a" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat" -> null
      - name                    = "cft-task-POSTGRES-USER" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat/secrets/cft-task-POSTGRES-USER/versions/52624bae09424e05b8ba7129fdc3d54a" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat/secrets/cft-task-POSTGRES-USER" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "52624bae09424e05b8ba7129fdc3d54a" -> null
      - versionless_id          = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-USER" -> null
    }

  # azurerm_key_vault_secret.POSTGRES-USER-FLEXIBLE-REPLICA-2[0] will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-USER-FLEXIBLE-REPLICA-2 is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-USER-FLEXIBLE-REPLICA-2" {
      - id                      = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-USER-FLEXIBLE-REPLICA-2/6969648b3f11432bb135b0e83ab5d340" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat" -> null
      - name                    = "cft-task-POSTGRES-USER-FLEXIBLE-REPLICA-2" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat/secrets/cft-task-POSTGRES-USER-FLEXIBLE-REPLICA-2/versions/6969648b3f11432bb135b0e83ab5d340" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat/secrets/cft-task-POSTGRES-USER-FLEXIBLE-REPLICA-2" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "6969648b3f11432bb135b0e83ab5d340" -> null
      - versionless_id          = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-USER-FLEXIBLE-REPLICA-2" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_DATABASE is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_DATABASE" {
      - id                      = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-DATABASE/be6425e1bedf454791ca76ed3989a37e" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat" -> null
      - name                    = "cft-task-POSTGRES-DATABASE" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat/secrets/cft-task-POSTGRES-DATABASE/versions/be6425e1bedf454791ca76ed3989a37e" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat/secrets/cft-task-POSTGRES-DATABASE" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "be6425e1bedf454791ca76ed3989a37e" -> null
      - versionless_id          = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-DATABASE" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE-FLEXIBLE-REPLICA-2[0] will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_DATABASE-FLEXIBLE-REPLICA-2 is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_DATABASE-FLEXIBLE-REPLICA-2" {
      - id                      = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-DATABASE-FLEXIBLE-REPLICA-2/f7196516480f49fcbc3adf7af240d869" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat" -> null
      - name                    = "cft-task-POSTGRES-DATABASE-FLEXIBLE-REPLICA-2" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat/secrets/cft-task-POSTGRES-DATABASE-FLEXIBLE-REPLICA-2/versions/f7196516480f49fcbc3adf7af240d869" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat/secrets/cft-task-POSTGRES-DATABASE-FLEXIBLE-REPLICA-2" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "f7196516480f49fcbc3adf7af240d869" -> null
      - versionless_id          = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-DATABASE-FLEXIBLE-REPLICA-2" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_HOST will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_HOST is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
      - id                      = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-HOST/4005a39ab8844c949ba3845413b859b8" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat" -> null
      - name                    = "cft-task-POSTGRES-HOST" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat/secrets/cft-task-POSTGRES-HOST/versions/4005a39ab8844c949ba3845413b859b8" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat/secrets/cft-task-POSTGRES-HOST" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "4005a39ab8844c949ba3845413b859b8" -> null
      - versionless_id          = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-HOST" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_HOST-FLEXIBLE-REPLICA-2[0] will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_HOST-FLEXIBLE-REPLICA-2 is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_HOST-FLEXIBLE-REPLICA-2" {
      - id                      = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-HOST-FLEXIBLE-REPLICA-2/de14625764084e9fad9733e8d377dbc4" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat" -> null
      - name                    = "cft-task-POSTGRES-HOST-FLEXIBLE-REPLICA-2" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat/secrets/cft-task-POSTGRES-HOST-FLEXIBLE-REPLICA-2/versions/de14625764084e9fad9733e8d377dbc4" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat/secrets/cft-task-POSTGRES-HOST-FLEXIBLE-REPLICA-2" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "de14625764084e9fad9733e8d377dbc4" -> null
      - versionless_id          = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-HOST-FLEXIBLE-REPLICA-2" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_PORT will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_PORT is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_PORT" {
      - id                      = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-PORT/a59d753fbf8a4fb09f72b93d212ffc33" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat" -> null
      - name                    = "cft-task-POSTGRES-PORT" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat/secrets/cft-task-POSTGRES-PORT/versions/a59d753fbf8a4fb09f72b93d212ffc33" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat/secrets/cft-task-POSTGRES-PORT" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "a59d753fbf8a4fb09f72b93d212ffc33" -> null
      - versionless_id          = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-PORT" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_PORT-FLEXIBLE-REPLICA-2[0] will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_PORT-FLEXIBLE-REPLICA-2 is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_PORT-FLEXIBLE-REPLICA-2" {
      - id                      = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-PORT-FLEXIBLE-REPLICA-2/974e0958603f423ca45ca8cefe480e1b" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat" -> null
      - name                    = "cft-task-POSTGRES-PORT-FLEXIBLE-REPLICA-2" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat/secrets/cft-task-POSTGRES-PORT-FLEXIBLE-REPLICA-2/versions/974e0958603f423ca45ca8cefe480e1b" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-aat/providers/Microsoft.KeyVault/vaults/wa-aat/secrets/cft-task-POSTGRES-PORT-FLEXIBLE-REPLICA-2" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "974e0958603f423ca45ca8cefe480e1b" -> null
      - versionless_id          = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-PORT-FLEXIBLE-REPLICA-2" -> null
    }

  # module.sdp_db_user.data.azurerm_key_vault.sdp_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "sdp_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "mi-vault-dev"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "mi-dev-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.sdp_db_user.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_name must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      ~ id                      = "https://mi-vault-dev.vault.azure.net/secrets/cft-task-postgres-db-flexible-replica-read-user-name/63ff99d033c644fab428245f8e6eefbc" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev" -> (known after apply) # forces replacement
        name                    = "cft-task-postgres-db-flexible-replica-read-user-name"
      ~ resource_id             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/cft-task-postgres-db-flexible-replica-read-user-name/versions/63ff99d033c644fab428245f8e6eefbc" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/cft-task-postgres-db-flexible-replica-read-user-name" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "63ff99d033c644fab428245f8e6eefbc" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-dev.vault.azure.net/secrets/cft-task-postgres-db-flexible-replica-read-user-name" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_password must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      - content_type            = "" -> null
      ~ id                      = "https://mi-vault-dev.vault.azure.net/secrets/cft-task-postgres-db-flexible-replica-read-user-password/36c4fc6768894b0da752e79ff6bfeb93" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev" -> (known after apply) # forces replacement
        name                    = "cft-task-postgres-db-flexible-replica-read-user-password"
      ~ resource_id             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/cft-task-postgres-db-flexible-replica-read-user-password/versions/36c4fc6768894b0da752e79ff6bfeb93" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/cft-task-postgres-db-flexible-replica-read-user-password" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "36c4fc6768894b0da752e79ff6bfeb93" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-dev.vault.azure.net/secrets/cft-task-postgres-db-flexible-replica-read-user-password" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.wa_task_management_api_database.azurerm_postgresql_active_directory_administrator.admin will be destroyed
  # (because azurerm_postgresql_active_directory_administrator.admin is not in configuration)
  - resource "azurerm_postgresql_active_directory_administrator" "admin" {
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-data-aat/providers/Microsoft.DBforPostgreSQL/servers/cft-task-postgres-db-aat" -> null
      - login               = "DTS Platform Operations" -> null
      - object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> null
      - resource_group_name = "cft-task-postgres-db-data-aat" -> null
      - server_name         = "cft-task-postgres-db-aat" -> null
      - tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.wa_task_management_api_database.azurerm_resource_group.data-resourcegroup will be destroyed
  # (because azurerm_resource_group.data-resourcegroup is not in configuration)
  - resource "azurerm_resource_group" "data-resourcegroup" {
      - id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-data-aat" -> null
      - location = "uksouth" -> null
      - name     = "cft-task-postgres-db-data-aat" -> null
      - tags     = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2023-10-02T15:09:40Z"
          - "managedBy"           = "Work Allocation"
        } -> null
    }

  # module.wa_task_management_api_database.azurerm_template_deployment.postgres-paas will be destroyed
  # (because azurerm_template_deployment.postgres-paas is not in configuration)
  - resource "azurerm_template_deployment" "postgres-paas" {
      - deployment_mode     = "Incremental" -> null
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-data-aat/providers/Microsoft.Resources/deployments/cft-task-postgres-db-aat" -> null
      - name                = "cft-task-postgres-db-aat" -> null
      - outputs             = {} -> null
      - parameters          = {
          - "administratorLogin"         = "wa_wa"
          - "administratorLoginPassword" = "!g_16o]n5iHu8ZD%"
          - "backupRetentionDays"        = "35"
          - "charset"                    = "utf8"
          - "collation"                  = "en-GB"
          - "commonTags"                 = "eyJhcHBsaWNhdGlvbiI6InRhc2stbWFuYWdlbWVudCIsImF1dG9TaHV0ZG93biI6InRydWUiLCJidWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvd2EtdGFzay1tYW5hZ2VtZW50LWFwaS5naXQiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI3dhLXRlY2giLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJsYXN0VXBkYXRlZCI6IjIwMjMtMTAtMDJUMTU6MDk6NDBaIiwibWFuYWdlZEJ5IjoiV29yayBBbGxvY2F0aW9uIn0="
          - "dbName"                     = "cft_task_db"
          - "dbRules"                    = "W3sicnVsZV9uYW1lIjoiY2Z0YWtzLXRmLWFrczAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvOTZjMjc0Y2UtODQ2ZC00ZTQ4LTg5YTctZDUyODQzMjI5OGE3L3Jlc291cmNlR3JvdXBzL2NmdC1hYXQtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NmdC1hYXQtdm5ldC9zdWJuZXRzL2Frcy0wMCJ9LHsicnVsZV9uYW1lIjoiY2Z0YWtzLXRmLWFrczAxIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvOTZjMjc0Y2UtODQ2ZC00ZTQ4LTg5YTctZDUyODQzMjI5OGE3L3Jlc291cmNlR3JvdXBzL2NmdC1hYXQtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NmdC1hYXQtdm5ldC9zdWJuZXRzL2Frcy0wMSJ9LHsicnVsZV9uYW1lIjoiYXNlIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvMWM0ZjA3MDQtYTI5ZS00MDNkLWI3MTktYjkwYzM0ZWYxNGM5L3Jlc291cmNlR3JvdXBzL2NvcmUtaW5mcmEtYWF0L3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY29yZS1pbmZyYS12bmV0LWFhdC9zdWJuZXRzL2NvcmUtaW5mcmEtc3VibmV0LTMtYWF0In0seyJydWxlX25hbWUiOiJha3MiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8xYzRmMDcwNC1hMjllLTQwM2QtYjcxOS1iOTBjMzRlZjE0YzkvcmVzb3VyY2VHcm91cHMvY29yZS1pbmZyYS1hYXQvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jb3JlLWluZnJhLXZuZXQtYWF0L3N1Ym5ldHMvYWtzIn0seyJydWxlX25hbWUiOiJqZW5raW5zLWFrcyIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFiYWY1NDcwLTFjM2UtNDBkMy1hNmY3LTc0YmZiY2U0YjM0OC9yZXNvdXJjZUdyb3Vwcy9jZnQtcHRsLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jZnQtcHRsLXZuZXQvc3VibmV0cy9pYWFzIn0seyJydWxlX25hbWUiOiJqZW5raW5zLWFrcy1hZ2VudCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFiYWY1NDcwLTFjM2UtNDBkMy1hNmY3LTc0YmZiY2U0YjM0OC9yZXNvdXJjZUdyb3Vwcy9jZnQtcHRsLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jZnQtcHRsLXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6InNoYXJlZC1zZXJ2aWNlcy10ZXN0LWFrczAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvM2VlYzViZGUtN2ZlYi00NTY2LWJmYjYtODA1ZGY2ZTEwYjkwL3Jlc291cmNlR3JvdXBzL3NzLXRlc3QtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL3NzLXRlc3Qtdm5ldC9zdWJuZXRzL2Frcy0wMCJ9LHsicnVsZV9uYW1lIjoic2hhcmVkLXNlcnZpY2VzLXRlc3QtYWtzMDEiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8zZWVjNWJkZS03ZmViLTQ1NjYtYmZiNi04MDVkZjZlMTBiOTAvcmVzb3VyY2VHcm91cHMvc3MtdGVzdC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3MtdGVzdC12bmV0L3N1Ym5ldHMvYWtzLTAxIn0seyJydWxlX25hbWUiOiJzaGFyZWQtc2VydmljZXMtc3RnLWFrczAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvNzRkYWNkNGYtYTI0OC00NWJiLWEyZjAtYWY3MDBkYzRjZjY4L3Jlc291cmNlR3JvdXBzL3NzLXN0Zy1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3Mtc3RnLXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6InNoYXJlZC1zZXJ2aWNlcy1zdGctYWtzMDEiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy83NGRhY2Q0Zi1hMjQ4LTQ1YmItYTJmMC1hZjcwMGRjNGNmNjgvcmVzb3VyY2VHcm91cHMvc3Mtc3RnLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9zcy1zdGctdm5ldC9zdWJuZXRzL2Frcy0wMSJ9LHsicnVsZV9uYW1lIjoiYmFzdGlvbi1ub25wcm9kLXZuZXQiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy9iNDRlYjQ3OS05YWUyLTQyZTctOWM2My1mM2M1OTk3MTliNmYvcmVzb3VyY2VHcm91cHMvYmFzdGlvbi1ub25wcm9kLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvYmFzdGlvbi1ub25wcm9kLXZuZXQvc3VibmV0cy9iYXN0aW9uIn0seyJydWxlX25hbWUiOiJpZGFtLWFhdDItdm5ldCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFjNGYwNzA0LWEyOWUtNDAzZC1iNzE5LWI5MGMzNGVmMTRjOS9yZXNvdXJjZUdyb3Vwcy9jb3JlLWluZnJhLWlkYW0tYWF0Mi9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NvcmUtaW5mcmEtdm5ldC1pZGFtLWFhdDIvc3VibmV0cy9jb3JlLWluZnJhLXN1Ym5ldC03LWlkYW0tYWF0MiJ9LHsicnVsZV9uYW1lIjoic2hhcmVkLXNlcnZpY2VzLWRldi1ha3MwMCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzg2N2E4NzhiLWNiNjgtNGRlNS05NzQxLTM2MWFjOWUxNzhiNi9yZXNvdXJjZUdyb3Vwcy9zcy1kZXYtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL3NzLWRldi12bmV0L3N1Ym5ldHMvYWtzLTAwIn0seyJydWxlX25hbWUiOiJzaGFyZWQtc2VydmljZXMtZGV2LWFrczAxIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvODY3YTg3OGItY2I2OC00ZGU1LTk3NDEtMzYxYWM5ZTE3OGI2L3Jlc291cmNlR3JvdXBzL3NzLWRldi1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3MtZGV2LXZuZXQvc3VibmV0cy9ha3MtMDEifV0="
          - "env"                        = "aat"
          - "geoRedundantBackup"         = "Enabled"
          - "location"                   = "UK South"
          - "serverName"                 = "cft-task-postgres-db-aat"
          - "skuCapacity"                = "8"
          - "skuName"                    = "GP_Gen5_8"
          - "skuSizeMB"                  = "51200"
          - "skuTier"                    = "GeneralPurpose"
          - "sslEnforcement"             = "Enabled"
          - "version"                    = "11"
        } -> null
      - resource_group_name = "cft-task-postgres-db-data-aat" -> null
      - template_body       = jsonencode(
            {
              - "$schema"      = "http://schema.management.azure.com/schemas/2014-04-01-preview/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - administratorLogin         = {
                      - maxLength = 16
                      - minLength = 1
                      - type      = "string"
                    }
                  - administratorLoginPassword = {
                      - type = "securestring"
                    }
                  - backupRetentionDays        = {
                      - defaultValue = 7
                      - type         = "string"
                    }
                  - charset                    = {
                      - type = "string"
                    }
                  - collation                  = {
                      - type = "string"
                    }
                  - commonTags                 = {
                      - type = "string"
                    }
                  - dbName                     = {
                      - type = "string"
                    }
                  - dbRules                    = {
                      - type = "string"
                    }
                  - env                        = {
                      - metadata = {
                          - description = "The tag"
                        }
                      - type     = "string"
                    }
                  - geoRedundantBackup         = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - location                   = {
                      - allowedValues = [
                          - "UK West",
                          - "ukwest",
                          - "UK South",
                          - "uksouth",
                        ]
                      - defaultValue  = "UK South"
                      - type          = "string"
                    }
                  - serverName                 = {
                      - maxLength = 63
                      - minLength = 2
                      - type      = "string"
                    }
                  - skuCapacity                = {
                      - defaultValue = 2
                      - type         = "string"
                    }
                  - skuFamily                  = {
                      - allowedValues = [
                          - "Gen5",
                        ]
                      - defaultValue  = "Gen5"
                      - type          = "string"
                    }
                  - skuName                    = {
                      - allowedValues = [
                          - "B_Gen5_1",
                          - "B_Gen5_2",
                          - "GP_Gen5_2",
                          - "GP_Gen5_4",
                          - "GP_Gen5_8",
                          - "GP_Gen5_16",
                          - "GP_Gen5_32",
                          - "MO_Gen5_2",
                          - "MO_Gen5_4",
                          - "MO_Gen5_8",
                          - "MO_Gen5_16",
                          - "MO_Gen5_32",
                        ]
                      - defaultValue  = "GP_Gen5_2"
                      - type          = "string"
                    }
                  - skuSizeMB                  = {
                      - defaultValue = "51200"
                      - type         = "string"
                    }
                  - skuTier                    = {
                      - allowedValues = [
                          - "Basic",
                          - "GeneralPurpose",
                          - "MemoryOptimized",
                        ]
                      - defaultValue  = "GeneralPurpose"
                      - type          = "string"
                    }
                  - sslEnforcement             = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - version                    = {
                      - allowedValues = [
                          - "9.5",
                          - "9.6",
                          - "10",
                          - "11",
                        ]
                      - defaultValue  = "9.6"
                      - type          = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - kind       = ""
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('serverName')]"
                      - properties = {
                          - administratorLogin         = "[parameters('administratorLogin')]"
                          - administratorLoginPassword = "[parameters('administratorLoginPassword')]"
                          - sslEnforcement             = "[parameters('sslEnforcement')]"
                          - storageProfile             = {
                              - backupRetentionDays = "[int(parameters('backupRetentionDays'))]"
                              - geoRedundantBackup  = "[parameters('geoRedundantBackup')]"
                              - storageMB           = "[parameters('skuSizeMB')]"
                            }
                          - version                    = "[parameters('version')]"
                        }
                      - resources  = [
                          - {
                              - apiVersion = "2017-12-01-preview"
                              - dependsOn  = [
                                  - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                                ]
                              - name       = "[parameters('dbName')]"
                              - properties = {
                                  - charset   = "[parameters('charset')]"
                                  - collation = "[parameters('collation')]"
                                }
                              - type       = "databases"
                            },
                        ]
                      - sku        = {
                          - capacity = "[parameters('skuCapacity')]"
                          - family   = "[parameters('skuFamily')]"
                          - name     = "[parameters('skuName')]"
                          - size     = "[parameters('skuSizeMB')]"
                          - tier     = "[parameters('skuTier')]"
                        }
                      - tags       = "[variables('tags')]"
                      - type       = "Microsoft.DBforPostgreSQL/servers"
                    },
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - copy       = {
                          - count = "[length(variables('dbRules'))]"
                          - name  = "storagecopy"
                        }
                      - dependsOn  = [
                          - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                        ]
                      - location   = "[parameters('location')]"
                      - name       = "[concat(parameters('serverName'), '/', variables('dbRules')[copyIndex()].rule_name)]"
                      - properties = {
                          - ignoreMissingVnetServiceEndpoint = true
                          - virtualNetworkSubnetId           = "[variables('dbRules')[copyIndex()].subnet_id]"
                        }
                      - type       = "Microsoft.DBforPostgreSQL/servers/virtualNetworkRules"
                    },
                ]
              - variables      = {
                  - dbRules = "[base64ToJson(parameters('dbRules'))]"
                  - tags    = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> null
    }

  # module.wa_task_management_api_database.null_resource.set-user-permissions[0] will be destroyed
  # (because null_resource.set-user-permissions is not in configuration)
  - resource "null_resource" "set-user-permissions" {
      - id       = "2619849972882974802" -> null
      - triggers = {
          - "db_reader_user" = "DTS CFT DB Access Reader"
          - "name"           = "cft-task-postgres-db"
          - "script_hash"    = "03f79db43eea0260e31fe3dc6925df25b0373bdeb9982b92bedf86dfd47d593a"
        } -> null
    }

  # module.wa_task_management_api_database.null_resource.subnet_mappings[0] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "2938623157579816487" -> null
      - triggers = {
          - "rule_name" = "cftaks-tf-aks00"
          - "subnet_id" = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-00"
        } -> null
    }

  # module.wa_task_management_api_database.null_resource.subnet_mappings[1] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "7342820617877220061" -> null
      - triggers = {
          - "rule_name" = "cftaks-tf-aks01"
          - "subnet_id" = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-01"
        } -> null
    }

  # module.wa_task_management_api_database.null_resource.subnet_mappings[2] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "4070455924185384384" -> null
      - triggers = {
          - "rule_name" = "ase"
          - "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-3-aat"
        } -> null
    }

  # module.wa_task_management_api_database.null_resource.subnet_mappings[3] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "2104261227421702920" -> null
      - triggers = {
          - "rule_name" = "aks"
          - "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/aks"
        } -> null
    }

  # module.wa_task_management_api_database.null_resource.subnet_mappings[4] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "791640208789416320" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/iaas"
        } -> null
    }

  # module.wa_task_management_api_database.null_resource.subnet_mappings[5] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "1113370130450831313" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks-agent"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-00"
        } -> null
    }

  # module.wa_task_management_api_database.null_resource.subnet_mappings[6] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "5040452191348428339" -> null
      - triggers = {
          - "rule_name" = "shared-services-test-aks00"
          - "subnet_id" = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/virtualNetworks/ss-test-vnet/subnets/aks-00"
        } -> null
    }

  # module.wa_task_management_api_database.null_resource.subnet_mappings[7] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "488362393838690245" -> null
      - triggers = {
          - "rule_name" = "shared-services-test-aks01"
          - "subnet_id" = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/virtualNetworks/ss-test-vnet/subnets/aks-01"
        } -> null
    }

  # module.wa_task_management_api_database.null_resource.subnet_mappings[8] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "8277125563324272808" -> null
      - triggers = {
          - "rule_name" = "shared-services-stg-aks00"
          - "subnet_id" = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/aks-00"
        } -> null
    }

  # module.wa_task_management_api_database.null_resource.subnet_mappings[9] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "494768449422678693" -> null
      - triggers = {
          - "rule_name" = "shared-services-stg-aks01"
          - "subnet_id" = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/aks-01"
        } -> null
    }

  # module.wa_task_management_api_database.null_resource.subnet_mappings[10] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "429581360949725966" -> null
      - triggers = {
          - "rule_name" = "bastion-nonprod-vnet"
          - "subnet_id" = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/bastion-nonprod-rg/providers/Microsoft.Network/virtualNetworks/bastion-nonprod-vnet/subnets/bastion"
        } -> null
    }

  # module.wa_task_management_api_database.null_resource.subnet_mappings[11] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "3419102971605058502" -> null
      - triggers = {
          - "rule_name" = "idam-aat2-vnet"
          - "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-aat2/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-aat2/subnets/core-infra-subnet-7-idam-aat2"
        } -> null
    }

  # module.wa_task_management_api_database.null_resource.subnet_mappings[12] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "6617624122250415739" -> null
      - triggers = {
          - "rule_name" = "shared-services-dev-aks00"
          - "subnet_id" = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/aks-00"
        } -> null
    }

  # module.wa_task_management_api_database.null_resource.subnet_mappings[13] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "1151930558435932185" -> null
      - triggers = {
          - "rule_name" = "shared-services-dev-aks01"
          - "subnet_id" = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/aks-01"
        } -> null
    }

  # module.wa_task_management_api_database.random_string.password will be destroyed
  # (because random_string.password is not in configuration)
  - resource "random_string" "password" {
      - id          = "!g_16o]n5iHu8ZD%" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "!g_16o]n5iHu8ZD%" -> null
      - special     = true -> null
      - upper       = true -> null
    }

  # module.wa_task_management_api_database_flexible.azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-aat"
        name                          = "cft-task-postgres-db-flexible-aat"
      ~ tags                          = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2023-10-02T15:09:40Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible.azurerm_resource_group.rg[0] will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-data-aat"
        name     = "cft-task-postgres-db-flexible-data-aat"
      ~ tags     = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2023-10-02T15:09:40Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-replica-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-replica-aat"
        name                          = "cft-task-postgres-db-flexible-replica-aat"
      ~ tags                          = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2023-10-02T15:09:40Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_resource_group.rg[0] will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-replica-data-aat"
        name     = "cft-task-postgres-db-flexible-replica-data-aat"
      ~ tags     = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2023-10-02T15:09:40Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.wa_task_management_api_database_flexible_replica_2[0].azurerm_postgresql_flexible_server.pgsql_server will be destroyed
  # (because azurerm_postgresql_flexible_server.pgsql_server is not in configuration)
  - resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      - administrator_login           = "pgadmin" -> null
      - administrator_password        = (sensitive value)
      - auto_grow_enabled             = false -> null
      - backup_retention_days         = 35 -> null
      - create_mode                   = "Default" -> null
      - delegated_subnet_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgresql" -> null
      - fqdn                          = "cft-task-postgres-db-flexible-replica-2-aat.postgres.database.azure.com" -> null
      - geo_redundant_backup_enabled  = false -> null
      - id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-replica-2-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-replica-2-aat" -> null
      - location                      = "uksouth" -> null
      - name                          = "cft-task-postgres-db-flexible-replica-2-aat" -> null
      - private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com" -> null
      - public_network_access_enabled = false -> null
      - replication_role              = "" -> null
      - resource_group_name           = "cft-task-postgres-db-flexible-replica-2-data-aat" -> null
      - sku_name                      = "GP_Standard_D2s_v3" -> null
      - storage_mb                    = 65536 -> null
      - tags                          = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2023-10-02T15:09:40Z"
          - "managedBy"           = "Work Allocation"
        } -> null
      - version                       = "14" -> null
      - zone                          = "3" -> null

      - authentication {
          - active_directory_auth_enabled = true -> null
          - password_auth_enabled         = true -> null
          - tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        }

      - high_availability {
          - mode                      = "ZoneRedundant" -> null
          - standby_availability_zone = "1" -> null
        }

      - maintenance_window {
          - day_of_week  = 0 -> null
          - start_hour   = 3 -> null
          - start_minute = 0 -> null
        }
    }

  # module.wa_task_management_api_database_flexible_replica_2[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be destroyed
  # (because azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin is not in configuration)
  - resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-replica-2-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-replica-2-aat/administrators/e7ea2042-4ced-45dd-8ae3-e051c6551789" -> null
      - object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> null
      - principal_name      = "DTS Platform Operations" -> null
      - principal_type      = "Group" -> null
      - resource_group_name = "cft-task-postgres-db-flexible-replica-2-data-aat" -> null
      - server_name         = "cft-task-postgres-db-flexible-replica-2-aat" -> null
      - tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.wa_task_management_api_database_flexible_replica_2[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be destroyed
  # (because azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin is not in configuration)
  - resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-replica-2-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-replica-2-aat/administrators/ca6d5085-485a-417d-8480-c3cefa29df31" -> null
      - object_id           = "ca6d5085-485a-417d-8480-c3cefa29df31" -> null
      - principal_name      = "jenkins-cftptl-intsvc-mi" -> null
      - principal_type      = "ServicePrincipal" -> null
      - resource_group_name = "cft-task-postgres-db-flexible-replica-2-data-aat" -> null
      - server_name         = "cft-task-postgres-db-flexible-replica-2-aat" -> null
      - tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.wa_task_management_api_database_flexible_replica_2[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be destroyed
  # (because azurerm_postgresql_flexible_server_configuration.pgsql_server_config is not in configuration)
  - resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      - id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-replica-2-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-replica-2-aat/configurations/backslash_quote" -> null
      - name      = "backslash_quote" -> null
      - server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-replica-2-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-replica-2-aat" -> null
      - value     = "on" -> null
    }

  # module.wa_task_management_api_database_flexible_replica_2[0].azurerm_postgresql_flexible_server_database.pg_databases["cft_task_db"] will be destroyed
  # (because azurerm_postgresql_flexible_server_database.pg_databases is not in configuration)
  - resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      - charset   = "UTF8" -> null
      - collation = "en_GB.utf8" -> null
      - id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-replica-2-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-replica-2-aat/databases/cft_task_db" -> null
      - name      = "cft_task_db" -> null
      - server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-replica-2-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-replica-2-aat" -> null
    }

  # module.wa_task_management_api_database_flexible_replica_2[0].azurerm_resource_group.rg[0] will be destroyed
  # (because azurerm_resource_group.rg is not in configuration)
  - resource "azurerm_resource_group" "rg" {
      - id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-replica-2-data-aat" -> null
      - location = "uksouth" -> null
      - name     = "cft-task-postgres-db-flexible-replica-2-data-aat" -> null
      - tags     = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2023-10-02T15:09:40Z"
          - "managedBy"           = "Work Allocation"
        } -> null
    }

  # module.wa_task_management_api_database_flexible_replica_2[0].null_resource.set-user-permissions-additionaldbs["cft_task_db"] will be destroyed
  # (because null_resource.set-user-permissions-additionaldbs is not in configuration)
  - resource "null_resource" "set-user-permissions-additionaldbs" {
      - id       = "5214355160013368569" -> null
      - triggers = {
          - "db_reader_user" = "DTS CFT DB Access Reader"
          - "name"           = "cft-task-postgres-db-flexible-replica-2"
          - "script_hash"    = "f1b050abe4f2e8fc188c106259b04ba5034688164070e5ebb3e10137ad569f93"
        } -> null
    }

  # module.wa_task_management_api_database_flexible_replica_2[0].random_password.password will be destroyed
  # (because random_password.password is not in configuration)
  - resource "random_password" "password" {
      - bcrypt_hash      = (sensitive value)
      - id               = "none" -> null
      - length           = 20 -> null
      - lower            = true -> null
      - min_lower        = 0 -> null
      - min_numeric      = 0 -> null
      - min_special      = 0 -> null
      - min_upper        = 0 -> null
      - number           = true -> null
      - numeric          = true -> null
      - override_special = "()-_" -> null
      - result           = (sensitive value)
      - special          = true -> null
      - upper            = true -> null
    }

Plan: 2 to add, 4 to change, 39 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1177,"Program":"tfcmt","SHA1":"","Vars":{}} -->